performance-tests/arillery-plan.yaml
config:
  target: "ws://chatbot-kafka-camel.apps.cluster-499d.499d.example.opentlc.com/echo"
  phases:
    - duration: 10  # Test for 60 seconds
      arrivalRate: 2000 # Every second, add 10 users
      rampTo: 50000 # And ramp it up to 100 users in total over the 60s period
      name: "Testando pacas"
scenarios:
  - engine: "ws"
    flow:
      - send: '{"code": "0","description": "teste","value": "10"}'  # Subscribe to the public channel
      - think: 1 # Every connection will remain open for 15s